# Formatting tampilan pada data frame

### Import Modul dan Cek Versi

In [19]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [18]:
n_rows = 5
n_cols = 2
cols = ['omset', 'operasional']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)),
                  columns=cols) #data bernilai integer dengan jangkauan 1-20
df

   omset  operasional
0     16            9
1      2           13
2     17           15
3      6            9
4     14            8

In [20]:
df['omset'] = df['omset'] * 100_000 #konversi ke seratus ribu
df['operasional'] = df['operasional'] * 10_000 #konversi ke sepuluh ribu
df

#penggunaan _ bertujuan sebagai ignore character

     omset  operasional
0  1600000        90000
1   200000       130000
2  1700000       150000
3   600000        90000
4  1400000        80000

In [21]:
df.index = pd.util.testing.makeDateIndex(n_rows, freq='D') #frekuensi daily atau interval harian
df = df.reset_index() #berfungsi untuk index saat ini menjadi kolom biasa dengan nama index
df = df.rename(columns={'index':'tanggal'}) #kolom index diganti menjadi kolom tanggal
df

     tanggal    omset  operasional
0 2000-01-01  1600000        90000
1 2000-01-02   200000       130000
2 2000-01-03  1700000       150000
3 2000-01-04   600000        90000
4 2000-01-05  1400000        80000

# Melakukan formatting tampilan Data Frame

In [22]:
formatku = {'tanggal':'{:%d/%m/%y}',
           'operasional':'Rp {:.2f}',
           'omset':'Rp {:.2f}'} #dictionary

#value dari setiap key berisi formatting terhadap datanya
#%d/%m/%y merepresentasikan day, month dan year
#{:.2f} menyertakan dua digit ekstra di belakang koma

laporan = df.style.format(formatku)
laporan

In [23]:
type(laporan)

pandas.io.formats.style.Styler

In [24]:
laporan.hide_index() #tidak menyertakan index

In [25]:
laporan.set_caption('Data Omset dan Operasional')
#menyertakan judul dari frame

In [26]:
laporan.highlight_min('omset', color='pink')
laporan.highlight_max('omset', color='lightgreen')

laporan.highlight_min('operasional', color='lightblue')
laporan.highlight_max('operasional', color='grey')

#highlight nilai minimum atau maximum di suatu kolom